<html>
<head>
<title>GCU Antriebsrechner V. 2.1.0</title>
</head>
<body style="font-family: sans-serif">
<h1 align="center">GCU Antriebsrechner V. 2.1.0</h1>
<p align="center">Berechnet &Uuml;bersetzungen und Ma&szlig;e f&uuml;r Fahrradantriebe
mit Kettenschaltung.</p>
<p align="center"><img src="cycling.jpg"></p>
<hr align="center" width="80%">
<h1>&Uuml;berblick</h1>
<p><i>Noch ein Ritzelrechner!</i> werden jetzt einige vielleicht sagen.
Und genau so ist es! Dieser hier kann unter anderem:</p>
<ul>
	<li>Ma&szlig;stabsgetreue grafische Darstellung der Antriebsgruppe</li>
	<li>Individuelle Berechnung der Schr&auml;glaufqualit&auml;t nach
	vorgegebenen Grenzwerten</li>
	<li>Alle Daten k&ouml;nnen gespeichert und wieder geladen werden</li>
	<li>Daten k&ouml;nnen als CSV (Excel), HTML und als PNG-Grafiken exportiert werden</li>
	<li>Plattformunabh&auml;ngig, aber trotzdem offline nutzbar</li>
	<li>Au&szlig;er zum Java Runtime Enviroment keine Abh&auml;ngigkeiten von anderer
	Software</li>
	<li>Unter der &quot;GNU General Public License&quot; verf&uuml;gbar</li>
</ul>
<p>Dieses Progr&auml;mmchen ist haupts&auml;chlich w&auml;hrend diverser Bahnfahrten auf den
Wegen von- und zur Arbeit entstanden. Zur Zeit ist mir das Wetter echt
zu mies, um die Strecke mit dem Rad zu Fahren, daher dachte ich, mache
ich mal etwas ein klein bisschen n&uuml;tzliches...</p>
<p>Fehlermeldungen und Anfragen bitte an <a href="mailto:bugs@mutantenzoo.de">bugs@mutantenzoo.de</a></p>
<p align="center"><big>Viel Spa&szlig;!</big></p>
<h1>Start</h1>
<p>Die Anwendung ben&ouml;tigt das Java Runtime Environment 5.0 (JRE 1.5.0),
erh&auml;ltlich Lizenzkostenfrei unter <a href="http://java.sun.com/j2se/1.5.0/download.jsp">http://java.sun.com/j2se/1.5.0/download.jsp</a>.
Da das JRE auch von vielen anderen Anwendungen ben&ouml;tigt wird, kann es
sein, dass es bereits installiert ist. In diesem Fall sind keine
weiteren Installationsschritte notwendig.</p>
<h2>Start unter Windows Explorer oder anderem grafischem Dateimanager</h2>
<p>Sofern das JRE korrekt installiert ist, die Datei &quot;gcu.jar&quot;
doppelklicken. Die Anwendung sollte nach einer kurzen Verz&ouml;gerung
starten.</p>
<h2>Start von einer Kommandozeile aus</h2>
<p>Sofern das JRE korrekt installiert ist, in das Verzeichnis wechseln,
in dem die Datei gcu.jar liegt und folgenden Befehl zum Start eingeben:</p>
<code>java -jar gcu-2.0.0.jar <i>[Profildateiname ...]</i></code>
<p><i>Profildateiname</i> ist dabei der Pfad einer Datei, die zuvor von
GCU gespeichert wurde (Name endet normalerweise mit &quot;.txt&quot; oder &quot;.xml&quot;).
Wird dieses Argument weggelassen, startet GCU mit einem leeren Profil.</p>
<p>Ab Version 2.0.0 k&ouml;nnen auch mehrere Dateien angegeben werden.</p>
<h1>Benutzung</h1>
<h2>Kompatibilit&auml;t mit fr&uuml;heren Versionen</h2>
<p>in der vorliegenden Version 2.0 wurde die Unterst&uuml;tzung f&uuml;r das in der
Version 1 noch unterst&uuml;tzte RRP-Format zugunsten des XML-Formats entfernt.</p>
<p>Vorhandene RRP-Dateien k&ouml;nnen aber mit einer Version 1.1 oder 1.2 geladen und
	dann wieder als XML-Datei gespeichert werden. Die &auml;lteren XML-Dateien sind
dann mit der Version 2.x kompatibel.</p>
<p>Das XML-Format wird in zuk&uuml;nftigen Version nur in der Weise weiterentwickelt,
	dass mit &auml;lteren Versionen gespeicherte XML-Dateien auch mit der jeweils
	neuesten Version
	ge&ouml;ffnet werden k&ouml;nnen. F&uuml;r das RRP-Format war mir das aber zu aufwendig,
	deshalb habe ich
es ab jetzt gleich von vornherein deaktiviert, um sp&auml;teren &Auml;rger zu vermeiden.</p>
<h2>Dokumentenreiter</h2>
<p>Ab Version 2.0.0 k&ouml;nnen mehrere Profile gleichzeitig geladen und bearbeitet
	werden. Die Dokumente werden dann in einer Karteikartenansicht angzeigt.</p>
	<p>Der eigentliche Nutzeffekt dieser Neuerung zeigt sich auf der letzten (am
weitesten rechts liegenden) Karteikarte. Siehe <a href="#comparison">die Beschreibung der Vergleichsansicht</a> f&uuml;r weitere Informationen.</p>
<h2>Eingabemaske</h2>
<p>Auf der linken Seite des Fensters werden die Eingabeparameter f&uuml;r die
Berechnungen eingegeben. Dabei werden zwei Aspekte unterschieden:
Parameter, die f&uuml;r die eigentliche &Uuml;bersetzungsberechnung notwendig
sind, und Parameter, die f&uuml;r die Berechnung des Kettenschr&auml;glaufs und
der grafischen Darstellung ben&ouml;tigt werden.</p>
<p>Diese Aspekte sind auf zwei Registerkarten verteilt, die unabh&auml;ngig
voneinander ausgef&uuml;llt werden k&ouml;nnen.</p>
<p>Die beiden Registerkarten sind jeweils wiederum in drei Bereiche
aufgeteilt:<br>
Kettenbl&auml;tter, Ritzel und allgemeine Einstellungen.</p>
<h3>Registerkarte &quot;&Uuml;bersetzung&quot;</h3>
<h4>Kettenbl&auml;tter</h4>
<p>Hier sind die Z&auml;hnezahlen der Kettenbl&auml;tter in absteigender
Reihenfolge einzutragen (eine andere Reihenfolge geht auch, kommt aber
in der Praxis kaum vor).</p>
<p>Zeilen k&ouml;nnen mit dem M&uuml;lleimersymbol gel&ouml;scht werden, ein Eintrag in
der untersten, leeren Zeile erzeugt automatisch ein neues Kettenblatt
mit der entsprechenden Z&auml;hnezahl. Die &Auml;nderungen werden sofort grafisch
und in der Ausgabetabelle angezeigt.</p>
<h4>Ritzel</h4>
<p>Hier gilt das gleiche wie oben bei &quot;Kettenbl&auml;tter&quot;
beschrieben, allerdings sollten hier die Z&auml;hnezahlen des Ritzelpakets in
<b>aufsteigender</b> Reihenfolge angegeben werden.</p>
<p>Sobald gen&uuml;gend Daten eingegeben wurden, f&uuml;llt sich die Grafik und
die Ausgabetabelle mit den m&ouml;glichen Gangkombinationen (siehe unten).</p>
<h4>Allgemein</h4>
<p>Hier wird entweder der Radumfang oder der Raddurchmesser in der
angezeigten Einheit angegeben, je nachdem was gerade bekannt ist. Der
jeweils andere Wert wird dann automatisch berechnet und angezeigt, weil
diese Werte direkt voneinander abh&auml;ngig sind.</p>
<p>Hier kann au&szlig;erdem eine Trittfrequenz eingegeben werden, die zur
Berechnung der Geschwindigkeiten in den jeweiligen G&auml;ngen benutzt wird.</p>
<h3>Registerkarte &quot;Ma&szlig;e&quot;</h3>
<h4>Kettenbl&auml;tter</h4>
<p>Hier ist die Kettenlinie und der Kettenblattabstand des Kurbelsatzes
einzugeben. Die Kettenlinie ist der Abstand von der Ebene
Rahmenl&auml;ngsachse/Rahmenhochachse bis zur Mitte zwischen dem &auml;u&szlig;ersten
und innersten Kettenblatt. Bei Einfachkurbeln ist also die Kettenlinie
der Abstand zwischen der Rahmenmitte und den Spitzen der Z&auml;hne des
Kettenblattes, bei Zweifachkurbeln zwischen der Rahmenmitte und der
Mitte zwischen den Spitzen der beiden Kettenbl&auml;tter, und bei
Dreifachkurbeln zwischen der Rahmenmitte und den Spitzen des mittleren
Kettenblatts.</p>
<p>Der Kettenblattabstand wird von Mitte zu Mitte gemessen und ist f&uuml;r
die Berechnung der individuellen Kettenlinien der einzelnen
Kettenbl&auml;tter, und damit f&uuml;r die Berechnung des Schr&auml;glaufs, sowie f&uuml;r
die grafische Darstellung notwendig.</p>
<h4>Ritzel</h4>
<p>Hier gilt sinngem&auml;&szlig; das gleiche wie f&uuml;r die Kettenbl&auml;tter. Leider ist
die Kettenlinie f&uuml;r ein Ritzelpaket nicht so richtig sch&ouml;n me&szlig;bar, aber
man k&ouml;nnte z.B. mit einer alten Hinterachse, an die rechtwinklig eine
Metalleiste angebracht ist, die Rahmenmitte auf die Hinterachse
&uuml;bertragen und dann messen.</p>
<p><a href="http://www.sheldonbrown.com/gloss_ch.html#chainline">Sheldon
Brown (http://www.sheldonbrown.com/gloss_ch.html#chainline)</a>
beschreibt ebenfalls (auf Englisch), wie die hintere Kettenlinie
gemessen werden kann.</p>
<h4>Allgemein</h4>
<p>Hier wird die Hinterbaul&auml;nge eingegeben, also der Abstand zwischen
Mitte Tretlagerwelle und Mitte Hinterachse.</p>
<p>Dieser Wert ist ebenfalls indirekt f&uuml;r die Berechnung des Schr&auml;glaufs
interessant</p>
<p>Au&szlig;erdem k&ouml;nnen hier die Toleranzgrenzen (in Grad) f&uuml;r den Schr&auml;glauf
eingegeben werden. Die Gradzahlen geben an, wie weit die Kette aus der
exakten Geraden beim Umlaufen um Kettenblatt und Ritzel seitlich
&quot;verbogen&quot; werden darf, um noch gr&uuml;n (optimal) bzw. gelb
(akzeptabel) angezeigt zu werden.</p>
<h2>Men&uuml; und Werkzeugleiste &quot;Ansicht&quot;</h2>
<p>Aus den grafischen und tabellarischen Ansichten k&ouml;nnen abh&auml;ngig vom
Schr&auml;glauf G&auml;nge aus- oder eingeblendet werden.</p>
<p>Hier gibt es die Stufen</p>
<ul>
	<li><img src="../toolbarButtonGraphics/general/AlignTop24.gif">Nur
	Optimale G&auml;nge</li>
	<li><img src="../toolbarButtonGraphics/general/AlignCenter24.gif">Akzeptable
	und Optimale G&auml;nge</li>
	<li><img src="../toolbarButtonGraphics/general/AlignBottom24.gif">Alle
	G&auml;nge, auch welche mit gro&szlig;em Schr&auml;glauf</li>
</ul>
<p>Dies soll die &Uuml;bersichtlichkeit verbessern, falls man sich nur f&uuml;r
die wirklich nutzbaren G&auml;nge interessiert. Standardm&auml;&szlig;ig werden beim
Programmstart alle G&auml;nge angezeigt.</p>
<h2>Grafik</h2>
<p>Die Grafik zeigt den Antrieb von oben. Die Rahmenmitte ist durch eine
Strichpunktlinie angedeutet.</p>
<p>Ansonsten sollten die angezeigten Ma&szlig;e dem entsprechen, was auf der
Registerkarte &quot;Ma&szlig;e&quot; angezeigt wird.</p>
<p>Mit dem Schieberegler kann die Vergr&ouml;&szlig;erung eingestellt werden, durch
Klicken und ziehen mit der Maus kann der Ansichtsbereich verschoben
werden.</p>
<p>Wer eine Maus mit Rad besitzt, kann den Vergr&ouml;&szlig;erungsfaktor auch
durch drehen am Mausrad ver&auml;ndern.</p>
<p>Wird in der Ausgabetabelle ein Gang ausgew&auml;hlt, so zeigt die Grafik
nur ie Kettenf&uuml;hrung f&uuml;r diesen einen Gang an, und zwar in der Farbe,
die dem Schr&auml;glaufzustand der Kette in diesem Gang entspricht. Gr&uuml;n
bedeutet, dass der Schr&auml;glauf unterhalb der Toleranzgrenze f&uuml;r den
optimalen Zustand bleibt, gelb bezeichnet einen immer noch akzeptablen
Zustand, und Rot bezeichnet einen nicht nutzbaren Gang.</p>
<h2>Ausgabetabelle</h2>
<p>Hier werden die errechneten Werte angezeigt, gleichzeitig zeigt ein
Farbbalken die Entfaltung und (durch seine Farbe) den Schr&auml;glaufzustand
in jedem vorhandenen Gang an.</p>
<p>Die Tabelle l&auml;sst sich nach belieben durch Klicken auf die
Spalten&uuml;berschriften umsortieren. Dabei gibt es drei Zust&auml;nde: Sortiert
nach Kettenbl&auml;ttern und Ritzeln, sortiert nach Entfaltung aufsteigend
und sortiert nach Entfaltung absteigend.</p>
<p>Ein kleines Pfeilsymbol in der Spalten&uuml;berschrift zeigt den
jeweiligen Zustand an, d.h. wenn kein Symbol angezeigt wird, befinden
wir uns im Zustand 1.</p>
<p>Durch Anklicken mit der Maus k&ouml;nnen einzelne G&auml;nge ausgew&auml;hlt werden,
die dann in der Grafik entsprechend hervorgehoben dargestellt werden.
Jede Umsortierung, Eingabe von Werten oder Fenstergr&ouml;&szlig;en&auml;nderung hebt
die Auswahl wieder auf und Zeigt in der Grafik wieder alle nach der
Filterung unter &quot;Ansicht&quot; sichtbaren G&auml;nge an.</p>
<h2>Men&uuml; &quot;Optionen&quot;</h2>
<h3>SI-Einheiten / Angloamerikanische Einheiten</h3>
<p>GCU kann intern entweder mit SI (metrischen) Einheiten oder
mit angloamerikanischen (Imperial, Customary) Einheiten rechnen.</p>
<p>Wird im Men&uuml; &quot;Optionen&quot; das Einheitensystem umgestellt,
so werden alle eingegebenen Werte in das entsprechende System
umgerechnet.</p>
<p>Die Auswahl des Einheitensystems hat nicht nur Auswirkungen
auf die reinen L&auml;ngeneinheiten, sondern bestimmt auch, ob
in der Ausgabetabelle eine <i>Entfaltung</i> oder 
ein Wert f&uuml;r die <i>Gear Inches</i> angezeigt wird.</p>
<p>Sind angloamerikanische Einheiten ausgew&auml;hlt, dann wird in
der Ausgabetabelle die Entfaltung als <i>Gear Inches</i>;
angezeigt.<i>Gear Inches</i> sind ganz einfach Laufraddurchmesser *
&Uuml;bersetzungsverh&auml;ltnis (in Zoll).</p><p>Im metrischen System wird die
Entfaltung in Metern angezeigt, dieser Wert errechnet sich aus
Laufradumfang * &Uuml;bersetzungsverh&auml;ltnis.</p>
<h2><a name="comparison">Vergleichsansicht</a></h2>
<p>Auf der letzen Karteikarte (Reiter ganz rechts) befindet sich - sofern &uuml;berhaupt mindestens ein Profil geladen ist - eine Vergleichsansicht der geladenen Profile. Jedes Profil wird auf einer eigenen Zeile angezeigt, dessen G&auml;nge werden durch Pfeile in der Farbe des jeweiligen Schr&auml;glaufstatus nach ihrer Entfaltung geordnet angedeutet. Dadurch erh&auml;lt man einen schnellen &Uuml;berblick &uuml;ber die Abst&auml;nde zwischen den einzelnen G&auml;ngen, den Gesamt&uuml;bersetzungsumfang und die Nutzbarkeit von G&auml;ngen, und das alles auf einen Blick im direkten Vergleich f&uuml;r mehrere Antriebsprofile.</p>
<p>Wie bei den Profilen ist auch hier &quot;Speichern Als&quot;, Exportieren und Drucken m&ouml;glich, allerdings kann diese Karteikarte nicht manuell geschlossen bzw. entfernt werden. Das einfache Speichern (ohne Angabe eines Dateinamens) ist ebenfalls nicht m&ouml;glich, weil die Vergleichsansicht auch nicht als solche geladen werden kann. Au&szlig;erdem verhalten sich die Funktionen etwas anders als bei den Profil-Karteikarten.</p><p>Die Druckfunktion druckt nur die angezeigte Grafik aus. je nach Anzahl der Profile empfehle ich den Ausdruck im Querformat.</p>
<p>Der Export der Vergleichsansicht funtioniert momentan nur als CSV-Datei oder als PNG-Grafik mit einer Breite von 1024 Pixeln. In einer zuk&uuml;nftigen Version wird dies auch noch konfigurierbar sein.</p>
<p>&quot;Speichern Als&quot; hat bei der Vergleichsansicht eine ganz besondere Bedeutung: Es wird eine Datei erzeugt, die alle momentan ge&ouml;ffneten Profile zusammen enth&auml;lt. Diese Datei kann ganz normal mit GCU sp&auml;ter wieder geladen werden, und die einzelnen Profile erscheinen wieder als Karteireiter. Damit wird nat&uuml;rlich auch die Vergleichsansicht wiederhergestellt, und die geladenen Profile k&ouml;nnen bearbeitet, separat gespeichert, oder verglichen und wieder gemeinsam gespeichert werden.</p>
</body>
</html>
